In [ ]:
addition_str="2+5+6+8+9"
v = addition_str.split("+") #that will contain the values of addition_srting as intiger
v

In [ ]:
addition_str="2+5+6+8+9"
number= addition_str.split("+")
sum_val=0
for num in number:
    sum_val+=int(num)
print(sum_val)

# Dictionary

In [ ]:
medal_count={ "country" : "India",
               "year": 2016,
               "type":"gold"
            }
# print(medal_count.keys())
# print(medal_count.values())
print(medal_count.items())

In [ ]:
swimmers = {'Manuel':4, 'Lochte':12, 'Adrian':7, 'Ledecky':5, 'Dirado':4}
#add additiona value 
swimmers["phelp"]=23
print(swimmers)

In [ ]:
def order_numbers(num1,num2):
    if num1>num2:
        return num2,num1
    else:     
        return num1,num2
    
smaller,bigger= order_numbers(15,25) 
print(smaller,bigger)

In [ ]:
def print_seconds(hours,minutes,seconds):
    t_seconds=3600*hours+60*minutes+seconds
    print(t_seconds)
    
print_seconds(1,2,3)

In [ ]:
def get_seconds(hours,minutes,seconds):
    return 3600*hours+60*minutes+seconds
    
amount_a=get_seconds(2,3,6)
amount_b=get_seconds(0,5,2)
result=amount_a+amount_b
print(result)

In [ ]:
# REPLACE THIS STARTER CODE WITH YOUR FUNCTION
june_days = 30
print("June has " + str(june_days) + " days.")
july_days = 31
print("July has " + str(july_days) + " days.")

In [ ]:
def month_days(name,days ):
    print(str(name)+" has "+str(days))
    
month_days('June',31)

In [ ]:
def f1(x, y):
    z = x*y  # the area is base*height
    print("The area is " + str(z))

In [ ]:
def rectangle_area(base,height):
        area= base*height
        print("Area of the rectangle is " + str(area))
rectangle_area(5,6)

In [ ]:
# 1) Complete the function to return the result of the conversion
def convert_distance(miles):
    km = miles * 1.6  # approximately 1.6 km in 1 mile

my_trip_miles = 55

# 2) Convert my_trip_miles to kilometers by calling the function above
my_trip_km = ___

# 3) Fill in the blank to print the result of the conversion
print("The distance in kilometers is " + ___)

# 4) Calculate the round-trip in kilometers by doubling the result,
#    and fill in the blank to print the result
print("The round-trip in kilometers is " + ___)

In [ ]:
# 1) Complete the function to return the result of the conversion
def convert_distance(miles):
    km = miles * 1.6  # approximately 1.6 km in 1 mile

my_trip_miles = 55

# 2) Convert my_trip_miles to kilometers by calling the function above
my_trip_km = convert_distance(55)

# 3) Fill in the blank to print the result of the conversion
print("The distance in kilometers is " + ___)

# 4) Calculate the round-trip in kilometers by doubling the result,
#    and fill in the blank to print the result
print("The round-trip in kilometers is " + ___)

# BMI calculator

In [ ]:
def bmi(weight,height):
    result= weight/(height**2)
    print("your BMI is " + str(result))
    
w=int(input("Enter your weight "))
h=float(input("Enter your height "))
bmi(w,h)

In [ ]:
def debolina():
    print("We are learning machine learning")
    print("Indian cyber security")

In [ ]:
debolina()

In [ ]:
def add(a,b):
    return a+b
add(8,6)

In [ ]:
winners = ['Kazuo Ishiguro', 'Rainer Weiss', 'Youyou Tu', 'Malala Yousafzai', 'Alice Munro', 'Alvin E. Roth']
winners.sort()
winners

In [ ]:
winners = ['Kazuo Ishiguro', 'Rainer Weiss', 'Youyou Tu', 'Malala Yousafzai', 'Alice Munro', 'Alvin E. Roth']
z=sorted(winners,reverse=True)
print(z)

In [ ]:
cawdra = ['candy', 'daisy', 'pear', 'peach', 'gem', 'crown']
lst=[]
for i in cawdra:
    lst.append(i)
print(i)

In [ ]:
cawdra = ['candy', 'daisy', 'pear', 'peach', 'gem', 'crown']
print(cawdra[3])
i=cawdra[2]
print(i)
print(len(cawdra))

In [ ]:
cawdra.append("jelly")
print(cawdra)

In [ ]:
cawdra.insert(2,'pear')
print(cawdra)

In [ ]:
cawdra.remove("pear")
print(cawdra)

In [ ]:
cawdra.pop(2)

# Copy of a list

In [ ]:
cawdra = ['candy', 'daisy', 'pear', 'peach', 'gem', 'crown']
mylist=cawdra.copy()
print(mylist)

In [ ]:
mylist=list(cawdra)
print(mylist)

# loop list

In [ ]:
cawdra = ['candy', 'daisy', 'pear', 'peach', 'gem', 'crown']
for i in cawdra:
    print(i)

In [ ]:
cawdra = ['candy', 'daisy', 'pear', 'peach', 'gem', 'crown']

for x in range(len(cawdra)):
    print(cawdra[x])

# Using while loop

In [ ]:
cawdra = ['candy', 'daisy', 'pear', 'peach', 'gem', 'crown']
i=0
while i<len(cawdra):
    print(cawdra[i])
    i+=1

# Looping Using List Comprehension

In [ ]:
cawdra = ['candy', 'daisy', 'pear', 'peach', 'gem', 'crown']
[print(x) for x in cawdra]

In [ ]:
thislist = ["apple", "banana", "cherry"]
[print(x) for x in thislist]

## Below are a set of scores that students have received in the past semester. Write code to determine how many are 90 or above and assign that result to the value a_scores.

In [ ]:
scores = "67 80 90 78 93 20 79 89 96 97 92 88 79 68 58 90 98 100 79 74 83 88 80 86 85 70 90 100"
scores1 = scores.split(" ")
#print(scores1)
a_scores=0
for i in scores1:
    if int(i)>=90:
        a_scores+=1
        
print(a_scores)        
#print(int_list)

#print(c)

In [ ]:
scores = "67 80 90 78 93 20 79 89 96 97 92 88 79 68 58 90 98 100 79 74 83 88 80 86 85 70 90 100"
lst = scores.split()
a_scores = 0
for i in lst:
    if int(i) >= 90:
        a_scores += 1
print(lst)

In [ ]:
str1 = "I love python"

chars = []
for i in str1:
    chars.append(i)
print(chars)

In [ ]:
scores = "67 80 90 78 93 20 79 89 96 97 92 88 79 68 58 90 98 100 79 74 83 88 80 86 85 70 90 100"
scores1 = scores.split(" ")
#print(scores1)
lst =[int(i) for i in scores1]
#print(lst)
a_scores=[]
for k in lst:
    if k >= 90:
        a_scores.append(k)
        a_scores.sort()
        
print(a_scores)

In [ ]:
stopwords = ['to', 'a', 'for', 'by', 'an', 'am', 'the', 'so', 'it', 'and', "The"]
org = "The organization for health, safety, and education"
words=org.split(" ")
#print(words)
acro = []
for i in words:
    #print(i)
    if i != str(stopwords):
        #print(i)
          acro+= str(words[0])
#        
print(acro)

# python string  methods

In [ ]:
# capitalize()
my_txt="i love python"
x=my_txt.capitalize()
print(x)

In [ ]:
#casefold-----converts srtings into lower case
my_txt="I LOVE PYTHON"
z=my_txt.casefold()
print(z)

In [ ]:
#center
a=" Debolina"
print(a.center(50))
a=" Debolina"
print(a.center(50,"*"))

In [ ]:
#count
txt = "I love apples, apple are my favorite fruit"
x=txt.count("apple")
print(x)
txt = "I love apples, apple are my favorite fruit"
x=txt.count("apple",5,100)
print(x)

In [ ]:
#endswith
txt = "I love apples, apple are my favorite fruit"
print(txt.endswith("frui"))

In [ ]:
#find
txt = "I love apples, apple are my favorite fruit"
x=txt.find("my")
print(x)

In [ ]:
sports = ['cricket', 'football', 'volleyball', 'baseball', 'softball', 'track and field', 'curling', 'ping pong', 'hockey']
sports.insert(2,"horse back riding")
print(sports)

In [ ]:
trav_dest = ['Beirut', 'Milan', 'Pittsburgh', 'Buenos Aires', 'Nairobi', 'Kathmandu', 'Osaka', 'London', 'Melbourne']

trav_dest.pop(7)

In [ ]:
trav_dest = ['Beirut', 'Milan', 'Pittsburgh', 'Buenos Aires', 'Nairobi', 'Kathmandu', 'Osaka', 'London', 'Melbourne']

trav_dest.append('Guajaldara')
print(trav_dest)

In [ ]:
winners = ['Kazuo Ishiguro', 'Rainer Weiss', 'Youyou Tu', 'Malala Yousafzai', 'Alice Munro', 'Alvin E. Roth']
winners.sort()
print(winners)

In [ ]:
winners = ['Kazuo Ishiguro', 'Rainer Weiss', 'Youyou Tu', 'Malala Yousafzai', 'Alice Munro', 'Alvin E. Roth']
z=sorted(winners,reverse=True)
print(z)

In [ ]:
str1 = "I love python"
# HINT: what's the accumulator? That should go here.
x=str1.replace(" ","")
print(x)
lst=[]
for i in x:
    lst.append(i)
print(i)

In [ ]:
wrds = ["end", 'work', "play", "start", "walk", "look", "open", "rain", "learn", "clean"]
past_tns=[]
for i in wrds:
    i+="ed"
    past_tns.append(i)
print(past_tns)

In [ ]:
n = int(input().strip())
if n>=2 and n<=5:
    if n%2==0:
        print("not wired")

In [ ]:
class point():
    def __init__(self,x):
        self.x=x
    def xvalue(self):
        return self.x
point1=point(5)
point2=point(10)
print(point1.xvalue())
print(point2.xvalue())

In [ ]:
class computer:
    def config(self):
        print("i5 ,16gb")
comp1=computer()
computer.config()

In [ ]:
class cal(a,b):
    def add(self):
        return a+b
    def sub(self):
        return a-b
    def mul(self):
        return a*b
    def div(self):
        return a/b
r=cal(10,5)
cal.add(5,6)

# Numpy

In [ ]:
import numpy as np
arr= np.array([1,2,3,4])
print(arr)

In [ ]:
import numpy as np 

print(np.__version__)

In [ ]:
import numpy as np 
arr= np.array([1,2,3,4,5,6])
print(arr)
print(type(arr))

In [ ]:
import numpy as np 
arr=np.array((1,2,3,4,5,6))
print(arr)

# 0_D array

In [ ]:
import numpy as np
arr=np.array(42)
print(arr)

# 1-D array

In [ ]:
import numpy as np 
arr= np.array([1,2,3,4,5,6])
print(arr)
print(type(arr))

# 2- D array

In [ ]:
import numpy as np 
arr= np.array([[1,2,3,4,5,6],[1,2,3,4,5,6]])
print(arr)

# 3-D array

In [ ]:
import numpy as np
arr=np.array([[[1,2,3,4,5,6],[1,2,3,4,]],[[1,2,3,4][1,2,3,4]]])
print(arr)

In [ ]:
import numpy as np
arr=np.array([1,2,3,4],ndmin=5)
print(arr)

# accesing elements of array

In [ ]:
import numpy as np 
arr=np.array([1,2,3,4,5,6])
#print(arr[0])
print(arr.dtype)

In [ ]:
import numpy as np 
arr=np.array([1,2,3,4,5,6])
print(arr[2:5])
print(arr[::2])

   # adding valu of array

In [ ]:
import numpy as np
arr=np.array([1,2,3,4,5,6])
print(arr[2]+arr[3])

# accesing elements of 2-D array

In [ ]:
import numpy as np
arr=np.array([1,2,3,4,5],ndmin=2)
print(arr[0,3])

In [ ]:
import numpy as np
arr=np.array([[1,2,3,4],[5,6,9,8]])

print(arr[1,3])
print(arr[0:4,0:2])

# data type in numpy

In [ ]:
import numpy as np
arr=np.array([1,2,3,4,5])
print(arr.dtype)

In [ ]:
import numpy as np
arr=np.array([1.2,2.6,3.0,4.9])
newArr=arr.astype('i')
print(arr.dtype)
print(newArr.dtype)

In [ ]:
import numpy as np
arr=np.array([[1,2,3],[4,5,6]])
print(arr[0,2])

In [ ]:
import numpy as np
arr=np.array([[[1,2,3],[4,5,6]],[[7,8,9],[8,5,2]]])
print(arr[0,1,2])
print(arr[1,1,2])

In [ ]:
import numpy as np
arr=np.array([1,2,3,4,5],ndmin=5)
print("Number of dimension is :",arr.ndim)

# slicing of 2-deminesional array

In [ ]:
import numpy as np
arr=np.array([[1,2,3,9,6,7],[4,5,6,7,5,3]])
print(arr[0,0::2])

In [ ]:
print(arr[0:2,2])

In [ ]:
print(arr[0:2,0:4])

# creating array with specific data type

In [ ]:
import numpy as np
arr=np.array([1,2,3,4],dtype="S")
print(arr)
print(arr.dtype)

In [ ]:
arr=np.array([1,2,3,4,6],dtype="i4")
print(arr.dtype)

# convert data typr in existing array

In [ ]:
import numpy as np
arr=np.array([1.1,2.3,4.2])
newarr=arr.astype("i")
print(newarr)
print(newarr.dtype)

In [ ]:
arr=np.array([1,0,3])
newarr=arr.astype("bool")
print(newarr)
print(newarr.dtype)

# copy and view array

In [ ]:
import numpy as np
arr=np.array([1,2,3,4,5])
x=arr.copy()
arr[0]=8
print(arr)
print(x)

In [ ]:
arr=np.array([7,8,9,6,5])
x=arr.view()
#arr[0]=10
x[0]=11
print(arr)
print(x)

In [ ]:
arr=np.array([1,2,3,4,5,6])
x=arr.copy()
y=arr.view()
print(x.base)
print(y.base)

In [ ]:
lis=[]
for i in range(10):
    lis.append(1)
print(lis)

In [ ]:
lis=[i for i in range(10)]
lis

In [ ]:
import numpy as np 
arr=np.array([[[1,2,3],[4,5,6]],[[7,8,9],[9,6,3]]])
for x in np.nditer(arr):
    print(x)

In [ ]:
arr=np.array([1,2,3,4])
for x in np.nditer(arr,flags=['buffered'],op_dtypes=["S"]):
    print(x)

In [ ]:
arr=np.array([1,2,3,4])
for idx,x in np.ndenumerate(arr):
    print(idx,x)

# filtering arrays

In [ ]:
import numpy as np
arr=np.array([1,2,3,4,5,6])
x=[True, False,True,False,False,True]
newarr=arr[x]
print(newarr)

In [ ]:
arr=np.array([1,2,3,4,5,6])
filter_arr=[]
for element in arr:
    if element >3:
        filter_arr.append(True)
    else:
        filter_arr.append(False)
newarr=arr[filter_arr]
print(newarr)
print(arr)

In [ ]:
import numpy as np

arr = np.array([41, 42, 43, 44])

# Create an empty list
filter_arr = []

# go through each element in arr
for element in arr:
  # if the element is higher than 42, set the value to True, otherwise False:
  if element > 42:
    filter_arr.append(True)
  else:
    filter_arr.append(False)

newarr = arr[filter_arr]

print(filter_arr)
print(newarr)

In [ ]:
import numpy as np
arr=np.array([10,20,6,8,16,7,9])
filter_arr=[]
for element in arr:
    if element%2==0:
        filter_arr.append(True)
    else:
        filter_arr.append(False)
newarr=arr[filter_arr]
print(arr)
print(newarr)

In [ ]:
arr=np.array([40,42,43,48,50])
filter_arr=arr>42
newarr=arr[filter_arr]
print(arr)
print(filter_arr)
print(newarr)

In [ ]:
arr=np.array([5,7,9,5,8,10,14])
filter_arr=arr%2==0
newarr=arr[filter_arr]
print(newarr)
print(filter_arr)

# sorting of array

In [ ]:
arr=np.array([0,3,1,5,4])
print(np.sort(arr))

In [ ]:
arr=np.array(["banana","apple","cherry"])
print(np.sort(arr))

In [ ]:
arr=np.array([[1,2,3,4],[4,5,6,7]])
print(np.sort(arr))

In [ ]:
arr=np.array([1,2,3,4,5,6,7,8])
x=np.where(arr==7)
print(x)

In [ ]:
x=np.where(arr%2==0)
print(x)

In [ ]:
x=np.where(arr%2==1)
print(x)

In [ ]:

arr=np.array([6,7,8,9])
x=np.searchsorted(arr,7)
print(x)

In [ ]:
arr=np.array([1,3,5,7])
x=np.searchsorted(arr,[2,4,6])
print(x)

In [ ]:
arr=np.array([1,2,3,5,4,8,9])
newarr=np.array_split(arr,3)
print(newarr)

In [ ]:
arr=np.array([1,2,3,5,4,8,9])
newarr=np.array_split(arr,4)
print(newarr)

In [ ]:
arr=np.array([1,2,3,4,5,8,7,9,8])
newarr=np.array_split(arr,3)
print(newarr[0])
print(newarr[1])
print(newarr[2])

In [ ]:
import numpy as np
np.full(shape=(5,6),fill_value=3.14)
np.full(shape=(3,3),fill_value=2.0)

In [ ]:
a= np.linspace(0,1,)

In [ ]:
import pandas as pd

In [ ]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 2', 'Store 3'])

# Your code here
df.loc["Item Purchased"]

In [ ]:
import pandas as pd

In [ ]:
numbers =[1,2,3,4,5,6]
pd.Series(numbers)

In [ ]:
animals=["tiger","Bear",None]
pd.Series(animals)

In [ ]:
Numbers=[1,2,None]
pd.Series(Numbers)

In [ ]:
sports={ "Archary": "Bhutan",
        "Golf"
    
}

In [ ]:
import pandas as pd
number =[1,5,9,6,3,5]
pd.Series(number)

In [ ]:
animals=["tiger","Lion",'bear']
pd.Series(animals)

In [ ]:
sports={"Archary":"Bhutan",
        "Golf":"Scotland",
        "Sumo":"Japan",
        "Taekowndo":"South Korea"
       }
s=pd.Series(sports)
s

In [ ]:
s["Sumo"]

In [ ]:
s.index

In [ ]:
s=pd.Series(['Tiger','Bear','Moose'],index=['India','America','Canada'])
s

In [ ]:
sports={
    "Archary":'Bhutan',
    'Golf':"Scotland",
    "Sumo":"japan",
    "Taekwondo":'South Korea'
    
}
s=pd.Series(sports)
s

In [ ]:
s.iloc[2]

In [ ]:
s.loc["Sumo"]

In [ ]:
s[3]

In [ ]:
s[0]

In [ ]:
s=pd.Series([100.00,101.00,3.2,2.33])
s

In [ ]:
s+=2
s

In [ ]:
total =0
for item in s:
    total+=item
print(total)

In [ ]:
import numpy as np
total=np.sum(s)
total

In [ ]:
s=pd.Series([100,200,400,500,600,100,50])
total=np.sum(s)
total

In [ ]:
len(s)

In [ ]:
s+=2
s.head()

In [ ]:
s=pd.Series(np.random.randint(0,1000,10000))
s

In [ ]:
a=pd.Series([1,2,3])
a

In [4]:
import pandas as pd
original_sports=pd.Series({
                'Archary':'Bhutan',
                'Golf':'Scotland',
                'Sumo':'Japan',
                'Taekowndo':'South Korea'
})

cricket_loving_country=pd.Series(
           ["Australia",
        "Barbados",
    "India",
    "Pakistan"],
    
    index=['cricket',
           'cricket',
           'cricket',
           'cricket'
          
          ]
)
all_countries=original_sports.append(cricket_loving_country)

In [2]:
original_sports

Archary           Bhutan
Golf            Scotland
Sumo               Japan
Taekowndo    South Korea
dtype: object

In [5]:
cricket_loving_country

cricket    Australia
cricket     Barbados
cricket        India
cricket     Pakistan
dtype: object

In [6]:
all_countries

Archary           Bhutan
Golf            Scotland
Sumo               Japan
Taekowndo    South Korea
cricket        Australia
cricket         Barbados
cricket            India
cricket         Pakistan
dtype: object

In [7]:
all_countries.loc['cricket']

cricket    Australia
cricket     Barbados
cricket        India
cricket     Pakistan
dtype: object

In [15]:
import pandas as pd
purchase=pd.Series({
    "Name":"Chris",
    "Item purchased": "Dog Food",
    "Cost": 22.50})
purchase_1=pd.Series({
    "Name":"Kevin",
    "Item purchased":"Kitty Litter",
    "cost":2.50})
purchase_2=pd.Series({
    "Name":"Vinod",
    "Item purchased":"Bird seed",
    "Cost": 5.00})

df=pd.DataFrame([purchase,purchase_1,purchase_2],index=['Store 1','strore 2','store 3'])
df.head()

           Name Item purchased  Cost  cost
Store 1   Chris       Dog Food  22.5   NaN
strore 2  Kevin   Kitty Litter   NaN   2.5
store 3   Vinod      Bird seed   5.0   NaN

In [2]:
import pandas as pd
number=[1,2,3,4,5,6]
pd.Series(number)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [6]:
sports={
    "Archary":"Bhutan",
    "Golf":'scotland',
    "Sumo":'Japan',
    "Taekondow":'South Korea'
    
}

s=pd.Series(sports)
s

Archary           Bhutan
Golf            scotland
Sumo               Japan
Taekondow    South Korea
dtype: object

In [8]:
s=pd.Series(["Tiger","bear","Moose"],index=['India','America',"Canada"])
s

India      Tiger
America     bear
Canada     Moose
dtype: object

In [10]:
sports={
    "Archary":'Bhutan',
    "Sumo":'Japan',
    'Taekondow':'South Korea'
}
s=pd.Series(sports,index=["Archary","Sumo",'Hockey'])
s

Archary    Bhutan
Sumo        Japan
Hockey        NaN
dtype: object

In [12]:
s.iloc[1]

'Japan'

In [14]:
s[1]

'Japan'

In [16]:
s=pd.Series([100,102.00,141.5,200.3])
s

0    100.0
1    102.0
2    141.5
3    200.3
dtype: float64

In [19]:
s+=2
s

0    106.0
1    108.0
2    147.5
3    206.3
dtype: float64

In [20]:
total=0
for item in s:
    total+=item
print(total)

567.8

In [21]:
import numpy as np
s=np.sum(s)
s

567.8

# data Frame

In [33]:
purchase_1=({
    "Name":"Kevin",
    "Item purchase":"Dog food",
    "Cost":20
})
purchase_2=({
     "Name":"Kevin",
    "Item purchase":"Bird Seed",
    "Cost":20
})
purchase_3=({
   "Name":"Kevin",
    "Item purchase":"Kitty litter",
    "Cost":20
    
})

df=pd.DataFrame([purchase_1,purchase_2,purchase_3],index=["Store_1","Store_2","Store_3"])
df.head()

          Name Item purchase  Cost
Store_1  Kevin      Dog food    20
Store_2  Kevin     Bird Seed    20
Store_3  Kevin  Kitty litter    20

In [29]:
df.loc["Store_3"]

Name                    Kevin
Itme purchase    Kitty litter
Cost                       20
Name: Store_3, dtype: object

In [35]:
df.loc[:,"Item purchase"]

Store_1        Dog food
Store_2       Bird Seed
Store_3    Kitty litter
Name: Item purchase, dtype: object

In [37]:
df.loc[:,"Cost"]

Store_1    20
Store_2    20
Store_3    20
Name: Cost, dtype: int64

In [38]:
df.T

                Store_1    Store_2       Store_3
Name              Kevin      Kevin         Kevin
Item purchase  Dog food  Bird Seed  Kitty litter
Cost                 20         20            20

In [40]:
df.loc['Store_1']['Cost']

20

In [43]:
copy_df=df.copy()
copy_df=copy_df.drop("Store_1")
copy_df
df

          Name Item purchase  Cost
Store_1  Kevin      Dog food    20
Store_2  Kevin     Bird Seed    20
Store_3  Kevin  Kitty litter    20

In [47]:
del copy_df["Name"]
copy_df

        Item purchase  Cost
Store_2     Bird Seed    20
Store_3  Kitty litter    20

In [49]:
df["Location"]=df['Cost']+5
df

          Name Item purchase  Cost  Location
Store_1  Kevin      Dog food    20        25
Store_2  Kevin     Bird Seed    20        25
Store_3  Kevin  Kitty litter    20        25

In [50]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df["Cost"]=df["Cost"]*0.8
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  18.0
Store 1  Kevyn   Kitty Litter   2.0
Store 2  Vinod      Bird Seed   4.0

In [58]:
df=pd.read_csv("olympics.csv")
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,Summer,01 !,02 !,03 !,Total,Winter,01 !,02 !,03 !,Total,Games,01 !,02 !,03 !,Combined total
1,Afghanistan(AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [60]:
df=pd.read_csv("olympics.csv")
print(df.to_string())

                                                0         1     2     3     4      5         6     7     8     9     10       11    12    13    14              15
0                                             NaN   Summer  01 !  02 !  03 !  Total   Winter  01 !  02 !  03 !  Total   Games  01 !  02 !  03 !  Combined total
1                               Afghanistan(AFG)        13     0     0     2      2         0     0     0     0      0       13     0     0     2               2
2                                   Algeria(ALG)        12     5     2     8     15         3     0     0     0      0       15     5     2     8              15
3                                 Argentina(ARG)        23    18    24    28     70        18     0     0     0      0       41    18    24    28              70
4                                   Armenia(ARM)         5     1     2     9     12         6     0     0     0      0       11     1     2     9              12
5                         Australasia(ANZ) [ANZ]         2     3     4     5     12         0     0     0     0      0        2     3     4     5              12
6                       Australia(AUS) [AUS] [Z]        25   139   152   177    468        18     5     3     4     12       43   144   155   181             480
7                                   Austria(AUT)        26    18    33    35     86        22    59    78    81    218       48    77   111   116             304
8                                Azerbaijan(AZE)         5     6     5    15     26         5     0     0     0      0       10     6     5    15              26
9                                   Bahamas(BAH)        15     5     2     5     12         0     0     0     0      0       15     5     2     5              12
10                                  Bahrain(BRN)         8     0     0     1      1         0     0     0     0      0        8     0     0     1               1
11                           Barbados(BAR) [BAR]        11     0     0     1      1         0     0     0     0      0       11     0     0     1               1
12                                  Belarus(BLR)         5    12    24    39     75         6     6     4     5     15       11    18    28    44              90
13                                  Belgium(BEL)        25    37    52    53    142        20     1     1     3      5       45    38    53    56             147
14                                  Bermuda(BER)        17     0     0     1      1         7     0     0     0      0       24     0     0     1               1
15                        Bohemia(BOH) [BOH] [Z]         3     0     1     3      4         0     0     0     0      0        3     0     1     3               4
16                                 Botswana(BOT)         9     0     1     0      1         0     0     0     0      0        9     0     1     0               1
17                                   Brazil(BRA)        21    23    30    55    108         7     0     0     0      0       28    23    30    55             108
18                British West Indies(BWI) [BWI]         1     0     0     2      2         0     0     0     0      0        1     0     0     2               2
19                             Bulgaria(BUL) [H]        19    51    85    78    214        19     1     2     3      6       38    52    87    81             220
20                                  Burundi(BDI)         5     1     0     0      1         0     0     0     0      0        5     1     0     0               1
21                                 Cameroon(CMR)        13     3     1     1      5         1     0     0     0      0       14     3     1     1               5
22                                   Canada(CAN)        25    59    99   121    279        22    62    56    52    170       47   121   155   173             449
23                                Chile(CHI) [I]        22     2     7     4     13        16     0     0     0      0       38     2     7     4              13
24                              China(CHN) [CHN]         9   201   146   126    473        10    12    22    19     53       19   213   168   145             526
25                                 Colombia(COL)        18     2     6    11     19         1     0     0     0      0       19     2     6    11              19
26                               Costa Rica(CRC)        14     1     1     2      4         6     0     0     0      0       20     1     1     2               4
27                        Ivory Coast(CIV) [CIV]        12     0     1     0      1         0     0     0     0      0       12     0     1     0               1
28                                  Croatia(CRO)         6     6     7    10     23         7     4     6     1     11       13    10    13    11              34
29                                 Cuba(CUB) [Z]        19    72    67    70    209         0     0     0     0      0       19    72    67    70             209
30                                   Cyprus(CYP)         9     0     1     0      1        10     0     0     0      0       19     0     1     0               1
31                     Czech Republic(CZE) [CZE]         5    14    15    15     44         6     7     9     8     24       11    21    24    23              68
32                     Czechoslovakia(TCH) [TCH]        16    49    49    45    143        16     2     8    15     25       32    51    57    60             168
33                              Denmark(DEN) [Z]        26    43    68    68    179        13     0     1     0      1       39    43    69    68             180
34                             Djibouti(DJI) [B]         7     0     0     1      1         0     0     0     0      0        7     0     0     1               1
35                       Dominican Republic(DOM)        13     3     2     1      6         0     0     0     0      0       13     3     2     1               6
36                                  Ecuador(ECU)        13     1     1     0      2         0     0     0     0      0       13     1     1     0               2
37                          Egypt(EGY) [EGY] [Z]        21     7     9    10     26         1     0     0     0      0       22     7     9    10              26
38                                  Eritrea(ERI)         4     0     0     1      1         0     0     0     0      0        4     0     0     1               1
39                                  Estonia(EST)        11     9     9    15     33         9     4     2     1      7       20    13    11    16              40
40                                 Ethiopia(ETH)        12    21     7    17     45         2     0     0     0      0       14    21     7    17              45
41                                  Finland(FIN)        24   101    84   117    302        22    42    62    57    161       46   143   146   174             463
42                       France(FRA) [O] [P] [Z]        27   202   223   246    671        22    31    31    47    109       49   233   254   293             780
43                                    Gabon(GAB)         9     0     1     0      1         0     0     0     0      0        9     0     1     0               1
44                                  Georgia(GEO)         5     6     5    14     25         6     0     0     0      0       11     6     5    14              25
45                        Germany(GER) [GER] [Z]        15   174   182   217    573        11    78    78    53    209       26   252   260   270             782
46             United Team of Germany(EUA) [EUA]         3    28    54    36    118         3     8     6     5     19        6    36    60    41             137
47                       East Germany(GDR) [GDR]         5   153   129   127    409         6    39    36    35    110       11   192   165   162             519
48                       West Germany(FRG) [FRG]         5    56    67    81    204         6    11    15    13     39       11    67    82    94             243
49                              Ghana(GHA) [GHA]        13     0     1     3      4         1     0     0     0      0       14     0     1     3               4
50                  Great Britain(GBR) [GBR] [Z]        27   236   272   272    780        22    10     4    12     26       49   246   276   284             806
51                               Greece(GRE) [Z]        27    30    42    39    111        18     0     0     0      0       45    30    42    39             111
52                                  Grenada(GRN)         8     1     0     0      1         0     0     0     0      0        8     1     0     0               1
53                                Guatemala(GUA)        13     0     1     0      1         1     0     0     0      0       14     0     1     0               1
54                             Guyana(GUY) [GUY]        16     0     0     1      1         0     0     0     0      0       16     0     0     1               1
55                                Haiti(HAI) [J]        14     0     1     1      2         0     0     0     0      0       14     0     1     1               2
56                          Hong Kong(HKG) [HKG]        15     1     1     1      3         4     0     0     0      0       19     1     1     1               3
57                                  Hungary(HUN)        25   167   144   165    476        22     0     2     4      6       47   167   146   169             482
58                                  Iceland(ISL)        19     0     2     2      4        17     0     0     0      0       36     0     2     2               4
59                                India(IND) [F]        23     9     6    11     26         9     0     0     0      0       32     9     6    11              26
60                                Indonesia(INA)        14     6    10    11     27         0     0     0     0      0       14     6    10    11              27
61                                 Iran(IRI) [K]        15    15    20    25     60        10     0     0     0      0       25    15    20    25              60
62                                     Iraq(IRQ)        13     0     0     1      1         0     0     0     0      0       13     0     0     1               1
63                                  Ireland(IRL)        20     9     8    12     29         6     0     0     0      0       26     9     8    12              29
64                                   Israel(ISR)        15     1     1     5      7         6     0     0     0      0       21     1     1     5               7
65                            Italy(ITA) [M] [S]        26   198   166   185    549        22    37    34    43    114       48   235   200   228             663
66                            Jamaica(JAM) [JAM]        16    17    30    20     67         7     0     0     0      0       23    17    30    20              67
67                                    Japan(JPN)        21   130   126   142    398        20    10    17    18     45       41   140   143   160             443
68                               Kazakhstan(KAZ)         5    16    17    19     52         6     1     3     3      7       11    17    20    22              59
69                                    Kenya(KEN)        13    25    32    29     86         3     0     0     0      0       16    25    32    29              86
70                              North Korea(PRK)         9    14    12    21     47         8     0     1     1      2       17    14    13    22              49
71                              South Korea(KOR)        16    81    82    80    243        17    26    17    10     53       33   107    99    90             296
72                                   Kuwait(KUW)        12     0     0     2      2         0     0     0     0      0       12     0     0     2               2
73                               Kyrgyzstan(KGZ)         5     0     1     2      3         6     0     0     0      0       11     0     1     2               3
74                                   Latvia(LAT)        10     3    11     5     19        10     0     4     3      7       20     3    15     8              26
75                                  Lebanon(LIB)        16     0     2     2      4        16     0     0     0      0       32     0     2     2               4
76                            Liechtenstein(LIE)        16     0     0     0      0        18     2     2     5      9       34     2     2     5               9
77                                Lithuania(LTU)         8     6     5    10     21         8     0     0     0      0       16     6     5    10              21
78                           Luxembourg(LUX) [O]        22     1     1     0      2         8     0     2     0      2       30     1     3     0               4
79                                Macedonia(MKD)         5     0     0     1      1         5     0     0     0      0       10     0     0     1               1
80                           Malaysia(MAS) [MAS]        12     0     3     3      6         0     0     0     0      0       12     0     3     3               6
81                                Mauritius(MRI)         8     0     0     1      1         0     0     0     0      0        8     0     0     1               1
82                                   Mexico(MEX)        22    13    21    28     62         8     0     0     0      0       30    13    21    28              62
83                                  Moldova(MDA)         5     0     2     5      7         6     0     0     0      0       11     0     2     5               7
84                                 Mongolia(MGL)        12     2     9    13     24        13     0     0     0      0       25     2     9    13              24
85                               Montenegro(MNE)         2     0     1     0      1         2     0     0     0      0        4     0     1     0               1
86                                  Morocco(MAR)        13     6     5    11     22         6     0     0     0      0       19     6     5    11              22
87                               Mozambique(MOZ)         9     1     0     1      2         0     0     0     0      0        9     1     0     1               2
88                                  Namibia(NAM)         6     0     4     0      4         0     0     0     0      0        6     0     4     0               4
89                          Netherlands(NED) [Z]        25    77    85   104    266        20    37    38    35    110       45   114   123   139             376
90           Netherlands Antilles(AHO) [AHO] [I]        13     0     1     0      1         2     0     0     0      0       15     0     1     0               1
91                        New Zealand(NZL) [NZL]        22    42    18    39     99        15     0     1     0      1       37    42    19    39             100
92                                    Niger(NIG)        11     0     0     1      1         0     0     0     0      0       11     0     0     1               1
93                                  Nigeria(NGR)        15     3     8    12     23         0     0     0     0      0       15     3     8    12              23
94                               Norway(NOR) [Q]        24    56    49    43    148        22   118   111   100    329       46   174   160   143             477
95                                 Pakistan(PAK)        16     3     3     4     10         2     0     0     0      0       18     3     3     4              10
96                                   Panama(PAN)        16     1     0     2      3         0     0     0     0      0       16     1     0     2               3
97                                 Paraguay(PAR)        11     0     1     0      1         1     0     0     0      0       12     0     1     0               1
98                                 Peru(PER) [L]        17     1     3     0      4         2     0     0     0      0       19     1     3     0               4
99                              Philippines(PHI)        20     0     2     7      9         4     0     0     0      0       24     0     2     7               9
100                                  Poland(POL)        20    64    82   125    271        22     6     7     7     20       42    70    89   132             291
101                                Portugal(POR)        23     4     8    11     23         7     0     0     0      0       30     4     8    11              23
102                             Puerto Rico(PUR)        17     0     2     6      8         6     0     0     0      0       23     0     2     6               8
103                                   Qatar(QAT)         8     0     0     4      4         0     0     0     0      0        8     0     0     4               4
104                                 Romania(ROU)        20    88    94   119    301        20     0     0     1      1       40    88    94   120             302
105                            Russia(RUS) [RUS]         5   132   121   142    395         6    49    40    35    124       11   181   161   177             519
106                    Russian Empire(RU1) [RU1]         3     1     4     3      8         0     0     0     0      0        3     1     4     3               8
107                      Soviet Union(URS) [URS]         9   395   319   296   1010         9    78    57    59    194       18   473   376   355            1204
108                      Unified Team(EUN) [EUN]         1    45    38    29    112         1     9     6     8     23        2    54    44    37             135
109                            Saudi Arabia(KSA)        10     0     1     2      3         0     0     0     0      0       10     0     1     2               3
110                                 Senegal(SEN)        13     0     1     0      1         5     0     0     0      0       18     0     1     0               1
111                            Serbia(SRB) [SRB]         3     1     2     4      7         2     0     0     0      0        5     1     2     4               7
112             Serbia and Montenegro(SCG) [SCG]         3     2     4     3      9         3     0     0     0      0        6     2     4     3               9
113                               Singapore(SIN)        15     0     2     2      4         0     0     0     0      0       15     0     2     2               4
114                          Slovakia(SVK) [SVK]         5     7     9     8     24         6     2     2     1      5       11     9    11     9              29
115                                Slovenia(SLO)         6     4     6     9     19         7     2     4     9     15       13     6    10    18              34
116                            South Africa(RSA)        18    23    26    27     76         6     0     0     0      0       24    23    26    27              76
117                               Spain(ESP) [Z]        22    37    59    35    131        19     1     0     1      2       41    38    59    36             133
118                         Sri Lanka(SRI) [SRI]        16     0     2     0      2         0     0     0     0      0       16     0     2     0               2
119                                   Sudan(SUD)        11     0     1     0      1         0     0     0     0      0       11     0     1     0               1
120                            Suriname(SUR) [E]        11     1     0     1      2         0     0     0     0      0       11     1     0     1               2
121                              Sweden(SWE) [Z]        26   143   164   176    483        22    50    40    54    144       48   193   204   230             627

In [67]:
df=pd.read_csv('olympics.csv',index_col=0,skiprows=1)
df.head()

,Summer,01 !,02 !,03 !,Total,Winter,01 !.1,02 !.1,03 !.1,Total.1,Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan(AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia(ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [68]:
df.columns

Index([' Summer', '01 !', '02 !', '03 !', 'Total', ' Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', ' Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [ ]:
for